tap "bufbuild/buf"
tap "fumiyanokesinn/tap"
tap "homebrew/services"
tap "mas-cli/tap"
# New way of working with Protocol Buffers
brew "buf"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Go version management
brew "goenv"
# Simple terminal UI for git commands
brew "lazygit"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Open source relational database management system
brew "mysql-client"
# Open source relational database management system
brew "mysql@8.0"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Fast, disk space efficient package manager
brew "pnpm"
# Plugin and runtime library for using protobuf with Swift
brew "swift-protobuf"
# Protoc plugin for generating gRPC Swift stubs
brew "protoc-gen-grpc-swift"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Get strong typed, autocompleted resources like images, fonts and segues
brew "rswift"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Incremental parsing library
brew "tree-sitter"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# CLI-based Pomodoro timer written in Go
brew "fumiyanokesinn/tap/pomodoro"
# Mac App Store command-line interface
brew "mas-cli/tap/mas"
# Chromium based browser
cask "arc"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Web debugging Proxy application
cask "charles"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Open-source keystroke visualiser
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
# Software for Logitech devices
cask "logi-options+"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
vscode "alefragnani.project-manager"
vscode "antfu.iconify"
vscode "anthropic.claude-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-todo-plus"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "omkarbhede.tailwindcss-tune"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "recca0120.vscode-phpunit"
vscode "shalldie.background"
vscode "streetsidesoftware.code-spell-checker"
vscode "tarik02.php-imports"
vscode "vitest.explorer"
vscode "voidzero.vite-plus-extension-pack"
vscode "xdebug.php-debug"
vscode "yzhang.markdown-all-in-one"
go "github.com/air-verse/air"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/review/git-codereview"
go "github.com/fumiyanokesinn/go-cli-tutor"
go "golang.org/x/tools/cmd/go-contrib-init"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "gotest.tools/gotestsum"
go "github.com/matryer/moq"
go "honnef.co/go/tools/cmd/staticcheck"
npm "@google/clasp"
npm "@google/gemini-cli"
npm "ccusage"
