alefragnani.project-manager
antfu.iconify
anthropic.claude-code
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
fabiospampinato.vscode-todo-plus
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
google.gemini-cli-vscode-ide-companion
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
oderwat.indent-rainbow
omkarbhede.tailwindcss-tune
oxc.oxc-vscode
pkief.material-icon-theme
recca0120.vscode-phpunit
shalldie.background
streetsidesoftware.code-spell-checker
tarik02.php-imports
vitest.explorer
voidzero.vite-plus-extension-pack
xdebug.php-debug
yzhang.markdown-all-in-one
